kiffie/pic32-pac/pic32mx2xx/pic32mx1xxfxxxd/PIC32MX170F256D.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OSC</name>
      <description>OSC peripheral</description>
      <baseAddress>0xbf80f000</baseAddress>
      <registers>
        <register>
          <name>OSCCON</name>
          <description>OSCCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>2097159</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UFRCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SLOCK</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ULOCK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PBDIV</name>
              <bitRange>[20:19]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCONCLR</name>
          <description>OSCCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UFRCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SLOCK</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ULOCK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PBDIV</name>
              <bitRange>[20:19]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCONSET</name>
          <description>OSCCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UFRCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SLOCK</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ULOCK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PBDIV</name>
              <bitRange>[20:19]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCONINV</name>
          <description>OSCCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UFRCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SLOCK</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ULOCK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PBDIV</name>
              <bitRange>[20:19]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[29:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUN</name>
          <description>OSCTUN register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUNCLR</name>
          <description>OSCTUNCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUNSET</name>
          <description>OSCTUNSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUNINV</name>
          <description>OSCTUNINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFOCON</name>
          <description>REFOCON register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFOCONCLR</name>
          <description>REFOCONCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFOCONSET</name>
          <description>REFOCONSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFOCONINV</name>
          <description>REFOCONINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFOTRIM</name>
          <description>REFOTRIM register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFOTRIMCLR</name>
          <description>REFOTRIMCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFOTRIMSET</name>
          <description>REFOTRIMSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFOTRIMINV</name>
          <description>REFOTRIMINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
