kiffie/pic32-pac/pic32mx2xx/pic32mx1xxfxxxd/PIC32MX170F256D.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CFG</name>
      <description>CFG peripheral</description>
      <baseAddress>0xbf80f200</baseAddress>
      <registers>
        <register>
          <name>CFGCON</name>
          <description>CFGCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>8</resetValue>
          <fields>
            <field>
              <name>TDOEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>JTAGEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PMDLOCK</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOLOCK</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVID</name>
          <description>DEVID register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DEVID</name>
              <bitRange>[27:0]</bitRange>
            </field>
            <field>
              <name>VER</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSKEY</name>
          <description>SYSKEY register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SYSKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSKEYCLR</name>
          <description>SYSKEYCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SYSKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSKEYSET</name>
          <description>SYSKEYSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SYSKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSKEYINV</name>
          <description>SYSKEYINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SYSKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD1</name>
          <description>PMD1 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AD1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTMUMD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CVRMD</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD1CLR</name>
          <description>PMD1CLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AD1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTMUMD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CVRMD</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD1SET</name>
          <description>PMD1SET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AD1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTMUMD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CVRMD</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD1INV</name>
          <description>PMD1INV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AD1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CTMUMD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CVRMD</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD2</name>
          <description>PMD2 register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD2CLR</name>
          <description>PMD2CLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD2SET</name>
          <description>PMD2SET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD2INV</name>
          <description>PMD2INV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMP2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD3</name>
          <description>PMD3 register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IC4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IC5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC3MD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>OC4MD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>OC5MD</name>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD3CLR</name>
          <description>PMD3CLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IC4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IC5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC3MD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>OC4MD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>OC5MD</name>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD3SET</name>
          <description>PMD3SET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IC4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IC5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC3MD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>OC4MD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>OC5MD</name>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD3INV</name>
          <description>PMD3INV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IC4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IC5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>OC3MD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>OC4MD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>OC5MD</name>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD4</name>
          <description>PMD4 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>T2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>T4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD4CLR</name>
          <description>PMD4CLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>T2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>T4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD4SET</name>
          <description>PMD4SET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>T2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>T4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD4INV</name>
          <description>PMD4INV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>T2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>T4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD5</name>
          <description>PMD5 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPI1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPI2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD5CLR</name>
          <description>PMD5CLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPI1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPI2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD5SET</name>
          <description>PMD5SET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPI1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPI2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD5INV</name>
          <description>PMD5INV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPI1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPI2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>I2C1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6</name>
          <description>PMD6 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCCMD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REFOMD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPMD</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6CLR</name>
          <description>PMD6CLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCCMD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REFOMD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPMD</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6SET</name>
          <description>PMD6SET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCCMD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REFOMD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPMD</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6INV</name>
          <description>PMD6INV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCCMD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REFOMD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PMPMD</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
