kiffie/pic32-pac/pic32mx2xx/pic32mx1xxfxxxd/PIC32MX170F256D.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INT</name>
      <description>INT peripheral</description>
      <baseAddress>0xbf881000</baseAddress>
      <registers>
        <register>
          <name>INTCON</name>
          <description>INTCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SS0</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCONCLR</name>
          <description>INTCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SS0</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCONSET</name>
          <description>INTCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SS0</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCONINV</name>
          <description>INTCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SS0</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>INTSTAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VEC</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SRIPL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMR</name>
          <description>IPTMR register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMRCLR</name>
          <description>IPTMRCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMRSET</name>
          <description>IPTMRSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMRINV</name>
          <description>IPTMRINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0</name>
          <description>IFS0 register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0CLR</name>
          <description>IFS0CLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0SET</name>
          <description>IFS0SET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0INV</name>
          <description>IFS0INV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AD1IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FSCMIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
