kiffie/pic32-pac/pic32mx2xx/pic32mx1xxfxxxd/PIC32MX170F256D.svd
        <register>
          <name>IPC9INV</name>
          <description>IPC9INV register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CTMUIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CTMUIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10</name>
          <description>IPC10 register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10CLR</name>
          <description>IPC10CLR register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10SET</name>
          <description>IPC10SET register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10INV</name>
          <description>IPC10INV register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
