kiffie/pic32-pac/pic32mx2xx/pic32mx1xxfxxxd/PIC32MX170F256D.svd
        <register>
          <name>CNPUA</name>
          <description>CNPUA register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUACLR</name>
          <description>CNPUACLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUASET</name>
          <description>CNPUASET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUAINV</name>
          <description>CNPUAINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDA</name>
          <description>CNPDA register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDACLR</name>
          <description>CNPDACLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDASET</name>
          <description>CNPDASET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDAINV</name>
          <description>CNPDAINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONA</name>
          <description>CNCONA register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONACLR</name>
          <description>CNCONACLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONASET</name>
          <description>CNCONASET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONAINV</name>
          <description>CNCONAINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENA</name>
          <description>CNENA register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENACLR</name>
          <description>CNENACLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENASET</name>
          <description>CNENASET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENAINV</name>
          <description>CNENAINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATA</name>
          <description>CNSTATA register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATACLR</name>
          <description>CNSTATACLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATASET</name>
          <description>CNSTATASET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATAINV</name>
          <description>CNSTATAINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
