kiffie/pic32-pac/pic32mx2xx/pic32mx1xxfxxxd/PIC32MX170F256D.svd
        <register>
          <name>ODCCSET</name>
          <description>ODCCSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCCINV</name>
          <description>ODCCINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUC</name>
          <description>CNPUC register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUCCLR</name>
          <description>CNPUCCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUCSET</name>
          <description>CNPUCSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUCINV</name>
          <description>CNPUCINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDC</name>
          <description>CNPDC register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDCCLR</name>
          <description>CNPDCCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDCSET</name>
          <description>CNPDCSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDCINV</name>
          <description>CNPDCINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONC</name>
          <description>CNCONC register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCCLR</name>
          <description>CNCONCCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCSET</name>
          <description>CNCONCSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONCINV</name>
          <description>CNCONCINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENC</name>
          <description>CNENC register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCCLR</name>
          <description>CNENCCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCSET</name>
          <description>CNENCSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENCINV</name>
          <description>CNENCINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATC</name>
          <description>CNSTATC register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATC0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATC5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATC6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATC7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATC8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATC9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
